Revit 2026 API

# WaveWavePhase Property

---

The property labeled "Phase" from the "Wave" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WavePhase { get; }
```
```vb
Public Shared ReadOnly Property WavePhase As String
	Get
```
```cpp
public:
static property String^ WavePhase {
	String^ get ();
}
```
```fsharp
static member WavePhase : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 10000".

#### Reference

Wave Class

Autodesk.Revit.DB.Visual Namespace